Pandas is a Python library used for data manipulation and analysis.

It provides two primary data structures:
1. Series (1D labeled array)
2. DataFrame (2D labeled table)

pip install pandas  # Install pandas
import pandas as pd  # Import pandas

In [33]:
import pandas as pd
s=pd.Series([1,2,3,4,5])
print(s)
type(s)
len(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

5

In [34]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(s1)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [35]:
df=pd.DataFrame({
    "names":["Lakhi","Harry","Rohan"],
    "marks":[100,53,45]
    },index=["1","2","3"])

print(df)
print(df['marks'].mean())
print(df['marks'].median())
print(df['marks'].mode())

   names  marks
1  Lakhi    100
2  Harry     53
3  Rohan     45
66.0
53.0
0     45
1     53
2    100
Name: marks, dtype: int64

In [36]:
data=pd.read_csv("sample1.csv")
data

     ID       Name           City
0   101       John       New York
1   102      Emily    Los Angeles
2   103    Michael        Chicago
3   104     Sophia        Houston
4   105     Daniel  San Francisco
5   106     Olivia          Miami
6   107      James        Seattle
7   108        Ava         Dallas
8   109    William         Boston
9   110        Mia         Denver
10  111   Benjamin        Atlanta
11  112  Charlotte   Philadelphia
12  113      Lucas        Phoenix
13  114     Amelia      San Diego
14  115      Henry      Las Vegas
15  116     Evelyn       Portland
16  117  Alexander    San Antonio
17  118     Harper        Detroit
18  119     Elijah        Orlando
19  120   Scarlett    Minneapolis
20  121    Matthew         Austin
21  122   Isabella       Columbus
22  123      David   Indianapolis
23  124     Sophia      Nashville
24  125     Joseph      Charlotte
25  126      Grace   Jacksonville
26  127     Samuel       San Jose
27  128       Lily     Fort Worth
28  129     Andrew        Memphis
29  130      Chloe        El Paso

In [37]:
data = pd.read_csv("sample1.csv") 
'''
data.head(2)  # First 2 rows  
data.tail(2)  # Last 2 rows  
data.info()  # Data summary  
data.describe()  # Stats summary  
data.shape  # (Rows, Columns)  
data.columns  # Column names  
df.iloc[0]  # Select first row (by index)

'''
data.head() # First 5 rows default

    ID     Name           City
0  101     John       New York
1  102    Emily    Los Angeles
2  103  Michael        Chicago
3  104   Sophia        Houston
4  105   Daniel  San Francisco

In [38]:
data = pd.read_csv("sample1.csv") 

data[data['ID']>125] # Filter rows

     ID    Name          City
25  126   Grace  Jacksonville
26  127  Samuel      San Jose
27  128    Lily    Fort Worth
28  129  Andrew       Memphis
29  130   Chloe       El Paso

In [39]:
data = pd.read_csv("sample1.csv") 

''' Some other functions can also use '''
data.sort_values('ID')
print(data['ID'].nlargest(2))
print(data['ID'].nsmallest(3))

29    130
28    129
Name: ID, dtype: int64
0    101
1    102
2    103
Name: ID, dtype: int64

In [40]:
data = pd.DataFrame({"Name":['Alice', 'Bob', None], 'Age': [25, None, 30]})
data.dropna()

    Name   Age
0  Alice  25.0

In [41]:
data = pd.DataFrame({"Name":['Alice', 'Bob', None], 'Age': [25, None, 30]})
data.fillna(0)

    Name   Age
0  Alice  25.0
1    Bob   0.0
2      0  30.0

In [42]:
data = pd.DataFrame({"Name":['Alice', 'Bob', None], 'Age': [25, None, 30]})
data.rename(columns={"Name":"name"},inplace=False)

    name   Age
0  Alice  25.0
1    Bob   NaN
2   None  30.0

In [43]:
data = pd.DataFrame({"Name":['Alice', 'Bob', None], 'Age': [25, None, 30]})
data['Age']=data['Age'].fillna(0,inplace=False).astype(int)
data

    Name  Age
0  Alice   25
1    Bob    0
2   None   30

Note: Any of the functions u perform in this will not effect the real csv data given until u use (inplace=True).

In [44]:
data = pd.DataFrame({"Name":['Alice', 'Bob', None], 'Age': [25, None, 30]})
# data["ageOne"]=[0 for i in range(len(df))]
def fx(a):
    return a*a

data["Age"]=data["Age"].fillna(0)
data["AgeSquare"]=data["Age"].apply(fx)
data

    Name   Age  AgeSquare
0  Alice  25.0      625.0
1    Bob   0.0        0.0
2   None  30.0      900.0

Note:

data.to_csv("export.csv",index=False)

used for make new csv with previous data

In [45]:
# First DataFrame
df1 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"]
})

# Second DataFrame
df2 = pd.DataFrame({
    "ID": [4, 5, 6],
    "Name": ["David", "Eve", "Frank"]
})

# Concatenating DataFrames
result = pd.concat([df1, df2], ignore_index=True)

# Merging on the 'ID' column
result1 = pd.merge(df1, df2, on="ID")

print(result)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eve
5   6    Frank